In [74]:
import pandas as pd
import numpy as np

data_file = "purchase_data.csv"
data_file_df = pd.read_csv(data_file)
data_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [64]:
total_players = data_file_df.loc[:, ["Gender", "SN", "Age"]]
total_players = total_players.drop_duplicates()
total_players.head()
players_count=total_players.count()[0]
pd.DataFrame({"Total Number of Players": [players_count]})

   Total Number of Players
0                      576

In [65]:
average_price = data_file_df["Price"].mean()
average_price =round(average_price,2)

average_price

3.05

In [66]:
Total_revenue = data_file_df["Price"].sum()
# Total_revenue= pd.DataFrame({"Total Revenue": [Total_revenue]})
Total_revenue

2379.77

In [67]:
Total_purchase_quantity = data_file_df["Purchase ID"].count()

Total_purchase_quantity

780

In [82]:
unique_items_count = len(data_file_df["Item Name"].unique())
unique_items_count

179

In [83]:
purchase_analysis = pd.DataFrame({"Number of Unique Items":[unique_items_count], 
                                  "Average Price in Dollars":[average_price],
                                  "Number of Purchases": [Total_purchase_quantity],
                                  "Total Revenue in Dollars": [Total_revenue]})
purchase_analysis= purchase_analysis.set_index("Number of Unique Items")
purchase_analysis ["Average Price in Dollars"] = purchase_analysis["Average Price in Dollars"].map("${:,.2f}".format)
purchase_analysis ["Total Revenue in Dollars"] = purchase_analysis["Total Revenue in Dollars"].map("${:,.2f}".format)
purchase_analysis

,Average Price in Dollars,Number of Purchases,Total Revenue in Dollars
Number of Unique Items,,,
179,$3.05,780,"$2,379.77"

In [84]:
gender_count = data_file_df["Gender"].value_counts()



gender_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [88]:
gender_percentage = gender_count/ players_count

gender_percentage

Male                     1.131944
Female                   0.196181
Other / Non-Disclosed    0.026042
Name: Gender, dtype: float64

In [89]:
gender_analysis_df=pd.DataFrame({"Gender Count": gender_count, "Gender Percentage": gender_percentage})
gender_analysis_df["Gender Percentage"]=gender_analysis_df["Gender Percentage"].map("{:,.2%}".format)
gender_analysis_df

                       Gender Count Gender Percentage
Male                            652           113.19%
Female                          113            19.62%
Other / Non-Disclosed            15             2.60%

In [270]:
gender_df = data_file_df.set_index("Gender")

gender_df= gender_df.groupby(["Gender"])
gender_df.count

In [271]:
gender_avg_price=gender_df["Price"].mean()
gender_avg_price= pd.DataFrame(round(gender_avg_price,2))
gender_avg_price= gender_avg_price.rename(columns={"Gender": "Gender", "Price": "Average Price"})
gender_avg_price

                       Average Price
Gender
Female                          3.20
Male                            3.02
Other / Non-Disclosed           3.35

In [272]:
gender_total_price=gender_df["Price"].sum()
gender_total_price=pd.DataFrame(gender_total_price)
gender_total_price= gender_total_price.rename(columns={"Gender": "Gender", "Price": "Total Price"})
gender_total_price

                       Total Price
Gender
Female                      361.94
Male                       1967.64
Other / Non-Disclosed        50.19

In [273]:
Avg_purchase_gender = gender_df["Purchase ID"].mean()
Avg_purchase_gender=pd.DataFrame(Avg_purchase_gender)
Avg_purchase_gender= Avg_purchase_gender.rename(columns={"Gender": "Gender","Purchase ID": "Average Total"})
Avg_purchase=(Avg_purchase_gender["Average Total"])/(gender_count["Gender Count"])
Avg_purchase_gender= round((Avg_purchase_gender["Average Total"])/(gender_count["Gender Count"]),2)
Avg_purchase_gender=pd.DataFrame(Avg_purchase_gender)
Avg_purchase_gender=Avg_purchase_gender.rename(columns={"Gender": "Gender", (0): "Average Purchase in Dollars"})

Avg_purchase_gender

                       Average Purchase in Dollars
Gender
Female                                        3.36
Male                                          0.60
Other / Non-Disclosed                        22.31

In [274]:
gender_purchase_analysis= pd.merge(gender_count, gender_avg_price, on="Gender")
gender_purchase_analysis=pd.merge(gender_purchase_analysis, gender_total_price, on="Gender")
gender_purchase_analysis=pd.merge(gender_purchase_analysis, Avg_purchase_gender, on="Gender")
gender_purchase_analysis=gender_purchase_analysis.rename(columns={"Gender": "Gender",(0): "Average Purchase"})
gender_purchase_analysis

,Gender Count,Average Price,Total Price,Average Purchase in Dollars
Gender,,,,
Male,652,3.02,1967.64,0.60
Female,113,3.20,361.94,3.36
Other / Non-Disclosed,15,3.35,50.19,22.31

In [275]:
bins = [0, 9, 13, 18, 23, 28, 33, 38, 140]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [276]:
age_count_df= pd.cut(data_file_df["Age"], bins, labels=group_names)
age_count_df= pd.DataFrame(age_count_df)
age_count_df=age_count_df.groupby("Age")

age_count_df= pd.DataFrame(age_count_df["Age"].count())
age_count_df= age_count_df.rename(columns={"Age": "Age", "Age": "Player Count"})
age_count_df

       Player Count
Age
<10              23
10-14            26
15-19           115
20-24           321
25-29           155
30-34            77
35-39            44
40+              19

In [277]:
age_percentage_df= pd.cut(data_file_df["Age"], bins, labels=group_names)
age_percentage_df=pd.DataFrame(age_percentage_df)
age_percentage_df= age_percentage_df.groupby("Age")

age_percentage_df= pd.DataFrame(age_percentage_df["Age"].count())
age_percentage_df= age_percentage_df.rename(columns={"Age": "Age", "Age": "Player Count"})
age_percentage_df= round(age_percentage_df["Player Count"]/780*100,2)
age_percentage_df=pd.DataFrame(age_percentage_df)
age_percentage_df= age_percentage_df.rename(columns={"Age": "Age", "Player Count": "Percentage"})
age_percentage_df

       Percentage
Age
<10          2.95
10-14        3.33
15-19       14.74
20-24       41.15
25-29       19.87
30-34        9.87
35-39        5.64
40+          2.44

In [278]:
age_analysis_df=pd.merge(age_count_df, age_percentage_df, on="Age")

age_analysis_df

       Player Count  Percentage
Age
<10              23        2.95
10-14            26        3.33
15-19           115       14.74
20-24           321       41.15
25-29           155       19.87
30-34            77        9.87
35-39            44        5.64
40+              19        2.44

In [279]:
new_df=pd.cut(data_file_df["Age"], bins, labels=group_names).head()
data_file_df["Age"] = pd.cut(data_file_df["Age"], bins, labels=group_names)
new_df=data_file_df
new_df= new_df.groupby("Age")
new_df

In [280]:
avg_price_df=round((new_df[["Price"]].mean()),2)
avg_price_df=avg_price_df.rename(columns={"Age":"Age", "Price": "Average Price in Dollars"})
avg_price_df

       Average Price in Dollars
Age
<10                        3.35
10-14                      2.92
15-19                      3.04
20-24                      3.03
25-29                      3.02
30-34                      2.95
35-39                      3.33
40+                        3.24

In [281]:
age_purchase_analysis=pd.merge(age_count_df, avg_price_df, on="Age")

age_purchase_analysis

       Player Count  Average Price in Dollars
Age
<10              23                      3.35
10-14            26                      2.92
15-19           115                      3.04
20-24           321                      3.03
25-29           155                      3.02
30-34            77                      2.95
35-39            44                      3.33
40+              19                      3.24

In [282]:
total_price_df=round((new_df[["Price"]].sum()),2)

total_price_df= total_price_df.rename(columns={"Age": "Age", "Price": "Total Purchase Value"})
total_price_df

       Total Purchase Value
Age
<10                   77.13
10-14                 75.87
15-19                349.82
20-24                973.82
25-29                467.99
30-34                227.10
35-39                146.48
40+                   61.56

In [283]:
age_purchase_analysis=pd.merge(age_purchase_analysis, total_price_df, on="Age")

age_purchase_analysis

       Player Count  Average Price in Dollars  Total Purchase Value
Age
<10              23                      3.35                 77.13
10-14            26                      2.92                 75.87
15-19           115                      3.04                349.82
20-24           321                      3.03                973.82
25-29           155                      3.02                467.99
30-34            77                      2.95                227.10
35-39            44                      3.33                146.48
40+              19                      3.24                 61.56

In [284]:
Avg_purchase = new_df["Purchase ID"].mean()
Avg_purchase=pd.DataFrame(Avg_purchase)
Avg_purchase= Avg_purchase.rename(columns={"Age": "Age","Purchase ID": "Average Total"})
Avg_purchase=round(((Avg_purchase["Average Total"])/(age_count_df["Player Count"])),2)
Avg_purchase=pd.DataFrame(Avg_purchase)
Avg_purchase=Avg_purchase.rename(columns={"Age": "Age",(0): "Avg Total Purchase per Person"})

Avg_purchase

       Avg Total Purchase per Person
Age
<10                            18.92
10-14                          13.51
15-19                           3.54
20-24                           1.20
25-29                           2.53
30-34                           4.80
35-39                           8.63
40+                            22.73

In [285]:
age_purchase_analysis=pd.merge(age_purchase_analysis, Avg_purchase, on="Age")

# age_purchase_analysis= age_purchase_analysis.rename(columns={"Age": "Age", (0): "Average Purchase"})
age_purchase_analysis

,Player Count,Average Price in Dollars,Total Purchase Value,Avg Total Purchase per Person
Age,,,,
<10,23,3.35,77.13,18.92
10-14,26,2.92,75.87,13.51
15-19,115,3.04,349.82,3.54
20-24,321,3.03,973.82,1.20
25-29,155,3.02,467.99,2.53
30-34,77,2.95,227.10,4.80
35-39,44,3.33,146.48,8.63
40+,19,3.24,61.56,22.73

In [286]:
data_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40+,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,25-29,Male,92,Final Critic,4.88
3,3,Chamassasya86,25-29,Male,100,Blindscythe,3.27
4,4,Iskosia90,20-24,Male,131,Fury,1.44

In [287]:
top_spenders_df= data_file_df.sort_values("SN")

top_spenders_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
467,467,Adairialis76,15-19,Male,123,Twilight's Carver,2.28
142,142,Adastirin33,35-39,Female,175,Woeful Adamantite Claymore,4.48
388,388,Aeda94,15-19,Male,128,"Blazeguard, Reach of Eternity",4.91
28,28,Aela59,20-24,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32
630,630,Aelaria33,20-24,Male,171,Scalpel,1.79

In [288]:
spenders_vcount_df = top_spenders_df["SN"].value_counts()
spenders_vcount_df= pd.DataFrame(spenders_vcount_df)

spenders_vcount_df= spenders_vcount_df.rename(columns={(0): "SN", "SN": "Purchase Count"})
spenders_vcount_df= spenders_vcount_df.reset_index()
spenders_vcount_df= spenders_vcount_df.rename(columns={("index"): "SN", "Purchase Count": "Purchase Count"})
spenders_vcount_df

                 SN  Purchase Count
0         Lisosia93               5
1            Iral74               4
2       Idastidru52               4
3          Phyali88               3
4      Saedaiphos46               3
..              ...             ...
571          Aeri84               1
572        Raisty38               1
573     Assjaskan56               1
574  Frichirranya75               1
575      Quilassa66               1

[576 rows x 2 columns]

In [289]:
top_spenders_df= top_spenders_df.groupby(['SN'])
print(top_spenders_df)
top_spenders_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x111793090>

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Adastirin33             1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1
Aelastirin39            2    2       2        2          2      2
Aelidru27               1    1       1        1          1      1
Aelin32                 3    3       3        3          3      3
Aelly27                 2    2       2        2          2      2
Aellynun67              1    1       1        1          1      1

In [294]:
spenders_avg_df=round((top_spenders_df["Price"].mean()),2)
spenders_avg_df= pd.DataFrame(spenders_avg_df)
spenders_avg_df= spenders_avg_df.rename(columns={"SN": "SN", "Price": "Average Purchase Price in Dollars"})
spenders_avg_df

               Average Purchase Price in Dollars
SN
Adairialis76                                2.28
Adastirin33                                 4.48
Aeda94                                      4.91
Aela59                                      4.32
Aelaria33                                   1.79
...                                          ...
Yathecal82                                  2.07
Yathedeu43                                  3.01
Yoishirrala98                               4.58
Zhisrisu83                                  3.94
Zontibe81                                   2.68

[576 rows x 1 columns]

In [295]:
top_spenders_analysis=pd.merge(spenders_vcount_df, spenders_avg_df, on="SN")

top_spenders_analysis

                 SN  Purchase Count  Average Purchase Price in Dollars
0         Lisosia93               5                               3.79
1            Iral74               4                               3.40
2       Idastidru52               4                               3.86
3          Phyali88               3                               3.43
4      Saedaiphos46               3                               2.94
..              ...             ...                                ...
571          Aeri84               1                               1.61
572        Raisty38               1                               3.27
573     Assjaskan56               1                               2.96
574  Frichirranya75               1                               4.23
575      Quilassa66               1                               4.23

[576 rows x 3 columns]

In [296]:
spenders_total_df=top_spenders_df["Price"].sum()
spenders_total_df= pd.DataFrame(spenders_total_df)
spenders_total_df= spenders_total_df.rename(columns={"SN": "SN", "Price": "Total Purchase Value in Dollars"})
spenders_total_df

               Total Purchase Value in Dollars
SN
Adairialis76                              2.28
Adastirin33                               4.48
Aeda94                                    4.91
Aela59                                    4.32
Aelaria33                                 1.79
...                                        ...
Yathecal82                                6.22
Yathedeu43                                6.02
Yoishirrala98                             4.58
Zhisrisu83                                7.89
Zontibe81                                 8.03

[576 rows x 1 columns]

In [297]:
top_spenders_analysis=pd.merge(top_spenders_analysis, spenders_total_df, on="SN")

top_spenders_analysis=top_spenders_analysis.set_index("SN")
top_spenders_analysis

,Purchase Count,Average Purchase Price in Dollars,Total Purchase Value in Dollars
SN,,,
Lisosia93,5,3.79,18.96
Iral74,4,3.40,13.62
Idastidru52,4,3.86,15.45
Phyali88,3,3.43,10.30
Saedaiphos46,3,2.94,8.83
...,...,...,...
Aeri84,1,1.61,1.61
Raisty38,1,3.27,3.27
Assjaskan56,1,2.96,2.96
Frichirranya75,1,4.23,4.23
Quilassa66,1,4.23,4.23

In [331]:
data_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40+,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,25-29,Male,92,Final Critic,4.88
3,3,Chamassasya86,25-29,Male,100,Blindscythe,3.27
4,4,Iskosia90,20-24,Male,131,Fury,1.44

In [343]:
pop_items_df= data_file_df.sort_values("Item ID")

pop_items_df.head()

     Purchase ID          SN    Age Gender  Item ID Item Name  Price
204          204  Chamimla85  15-19   Male        0  Splinter   1.28
662          662  Mindilsa60  20-24   Male        0  Splinter   1.28
133          133    Phaena87  20-24   Male        0  Splinter   1.28
150          150    Inasti31  15-19   Male        0  Splinter   1.28
121          121    Ilosia37  20-24   Male        1  Crucifer   3.26

In [344]:
pop_count_df = pop_items_df["Item ID"].value_counts()
pop_count_df= pd.DataFrame(pop_count_df)

pop_count_df= pop_count_df.rename(columns={(0): "Item ID", "Item ID": "Purchase Count"})
pop_count_df= pop_count_df.reset_index()
pop_count_df= pop_count_df.rename(columns={("index"): "Item ID", "Purchase Count": "Purchase Count"})
pop_count_df

     Item ID  Purchase Count
0        178              12
1         82               9
2        108               9
3        145               9
4         92               8
..       ...             ...
178       42               1
179      118               1
180      104               1
181       27               1
182       51               1

[183 rows x 2 columns]

In [345]:
pop_items_df= pop_items_df.groupby(['Item ID', 'Item Name','Price'])
print(pop_items_df)
pop_items_df.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x111718050>

                                  Purchase ID  SN  Age  Gender
Item ID Item Name          Price
0       Splinter           1.28             4   4    4       4
1       Crucifer           3.26             3   3    3       3
2       Verdict            2.48             6   6    6       6
3       Phantomlight       2.49             6   6    6       6
4       Bloodlord's Fetish 1.70             5   5    5       5

In [350]:
item_total_df=pop_items_df["Price"].sum()
item_total_df= pd.DataFrame(item_total_df)
item_total_df= item_total_df.rename(columns={(0): "Item ID", "Price": "Total Purchase Value"})
item_total_df= item_total_df.reset_index()
item_total_df

     Item ID                        Item Name  Price  Total Purchase Value
0          0                         Splinter   1.28                  5.12
1          1                         Crucifer   3.26                  9.78
2          2                          Verdict   2.48                 14.88
3          3                     Phantomlight   2.49                 14.94
4          4               Bloodlord's Fetish   1.70                  8.50
..       ...                              ...    ...                   ...
178      179  Wolf, Promise of the Moonwalker   4.48                 26.88
179      180                      Stormcaller   3.36                  3.36
180      181                    Reaper's Toll   1.66                  8.30
181      182                        Toothpick   4.03                 12.09
182      183              Dragon's Greatsword   1.09                  3.27

[183 rows x 4 columns]

In [359]:
pop_analysis=pd.merge(item_total_df, pop_count_df, on="Item ID")

pop_analysis=pop_analysis.set_index(["Item ID", "Item Name"])
pop_analysis= pop_analysis.sort_values("Purchase Count", ascending=False)
pop_analysis = pop_analysis[["Purchase Count", "Price","Total Purchase Value"]]
pop_analysis.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [360]:
profit_analysis= pop_analysis.sort_values("Total Purchase Value", ascending=False)
profit_analysis.head()

,,Purchase Count,Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80